apigee.svici.sys/Utilities/Data/RequestTemplates/StoreTemplates/BTRT2_Credit_Req_Resp.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:app="http://application.bpc.ru/">
	<soapenv:Header />
	<soapenv:Body>
		<app:storeApplication>
			<uid>{0}</uid>
			<application id="{1}">
				<templateName>{2}</templateName>
				<instId>{3}</instId>
				<agentId>{4}</agentId>
				<block name="{5}">
					<blocks>
						<block name="MAIN_BLOCK">
							<fields>
								<field id="3">
									<name>Contract ID</name>
									<valueString>{6}</valueString>
								</field>
								<field id="763">
									<name>Batch ID</name>
									<valueString>{7}</valueString>
								</field>
							</fields>
						</block>
						<block name="CUSTOMER_BLOCK">
							<fields>
								<field id="19">
									<name>Customer ID</name>
									<valueString>{8}</valueString>
								</field>
							</fields>
						</block>
						<block name="CARDHOLDER_BLOCK">
							<blocks>
								<block name="PERSON_BLOCK">
									<fields>
										<field id="24">
											<name>Person ID</name>
											<valueString>{9}</valueString>
										</field>
										<field id="25">
											<name>First Name</name>
											<valueString>{10}</valueString>
										</field>
										<field id="27">
											<name>Surname</name>
											<valueString>{11}</valueString>
										</field>
										<field id="28">
											<name>Date of Birth</name>
											<valueDate>{12}</valueDate>
										</field>
										<field id="30">
											<name>Emergency Contact Name</name>
											<valueString>{13}</valueString>
										</field>
										<field id="31">
											<name>Emergency Contact No</name>
											<valueString>{14}</valueString>
										</field>
										<field id="191">
											<name>Person processing mode</name>
											<valueNumber>{15}</valueNumber>
										</field>
										<field id="682">
											<name>Security Question #1</name>
											<valueString>{16}</valueString>
										</field>
										<field id="29">
											<name>Security ID #1</name>
											<valueString>{17}</valueString>
										</field>
										<field id="34">
											<name>Sex</name>
											<valueString>{18}</valueString>
										</field>
										<field id="35">
											<name>Marital Status</name>
											<valueString>{19}</valueString>
										</field>
										<field id="36">
											<name>Residence</name>
											<valueString>{20}</valueString>
										</field>
										<field id="40">
											<name>Employed Flag</name>
											<valueString>{21}</valueString>
										</field>
										<field id="43">
											<name>Person"s Style</name>
											<valueString>{22}</valueString>
										</field>
										<field id="17">
											<name>Type of the person"s ID</name>
											<valueString>{23}</valueString>
										</field>
										<field id="18">
											<name>Number of the person"s ID</name>
											<valueString>{24}</valueString>
										</field>
									</fields>
								</block>
								<block name="ADDRESS_BLOCK">
									<fields>
										<field id="78">
											<name>Address ID</name>
											<valueString>{25}</valueString>
										</field>
										<field id="79">
											<name>Address Type</name>
											<valueString>{26}</valueString>
										</field>
										<field id="190">
											<name>Address processing mode</name>
											<valueNumber>{27}</valueNumber>
										</field>
										<field id="81">
											<name>Address Line 1</name>
											<valueString>{28}</valueString>
										</field>
										<field id="82">
											<name>Address Line 2</name>
											<valueString>{29}</valueString>
										</field>
										<field id="88">
											<name>Primary Phone</name>
											<valueString>{30}</valueString>
										</field>
										<field id="89">
											<name>Secondary Phone</name>
											<valueString>{31}</valueString>
										</field>
										<field id="90">
											<name>Mobile Phone</name>
											<valueString>{32}</valueString>
										</field>
										<field id="92">
											<name>E-mail</name>
											<valueString>{33}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
						</block>
						<block name="CARD_BLOCK">
							<blocks>
								<block name="CARD_INIT_BLOCK">
									<fields>
										<field id="44">
											<name>Card Number</name>
											<valueString>{34}</valueString>
										</field>
										<field id="47">
											<name>Card Type</name>
											<valueString>{35}</valueString>
										</field>
									</fields>
								</block>
								<block name="CARD_DATA_BLOCK">
									<fields>
										<field id="51">
											<name>Embossed Name</name>
											<valueString>{36}</valueString>
										</field>
										<field id="329">
											<name>Cycle Scheme</name>
											<valueNumber>{37}</valueNumber>
										</field>
										<field id="331">
											<name>Limits Scheme</name>
											<valueNumber>{38}</valueNumber>
										</field>
										<field id="335">
											<name>Fee Scheme</name>
											<valueNumber>{39}</valueNumber>
										</field>
										<field id="829">
											<name>Region list</name>
											<valueString>{40}</valueString>
										</field>
									</fields>
								</block>
								<block name="DELIVERY_BLOCK">
									<fields>
										<field id="744">
											<name>Delivery Instructions</name>
											<valueString>{41}</valueString>
										</field>
										<field id="327">
											<name>Delivery Agent Code</name>
											<valueString>{42}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
						</block>
						<block name="ACCOUNT_BLOCK">
							<blocks>
								<block name="ACCOUNT_INIT_BLOCK">
									<fields>
										<field id="60">
											<name>Account number</name>
											<valueString>{43}</valueString>
										</field>
										<field id="62">
											<name>Account Type</name>
											<valueString>{44}</valueString>
										</field>
										<field id="61">
											<name>Currency Code</name>
											<valueString>{45}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
						</block>
						{46}
					</blocks>
				</block>
			</application>
		</app:storeApplication>
	</soapenv:Body>
</soapenv:Envelope>